robertinant/emt/src/ti/runtime/wiring/cc13xx/variants/CC1350STK/Board_init.c
const uint_least8_t SPI_count = CC1350STK_SPICOUNT;

/*
 *  ============================= UART ===================================
*/

/* Include drivers */
#include <ti/drivers/UART.h>
#include <ti/drivers/uart/UARTCC26X0.h>


extern void UARTCC26X0_close(UART_Handle handle);
extern int_fast16_t UARTCC26X0_control(UART_Handle handle, uint_fast16_t cmd,
        void *arg);
extern void UARTCC26X0_init(UART_Handle handle);
extern UART_Handle UARTCC26X0_open(UART_Handle handle, UART_Params *params);
extern int_fast32_t UARTCC26X0_read(UART_Handle handle, void *buffer, size_t size);
extern void UARTCC26X0_readCancel(UART_Handle handle);
extern int_fast32_t UARTCC26X0_readPolling(UART_Handle handle, void *buffer,
        size_t size);
extern int_fast32_t UARTCC26X0_write(UART_Handle handle, const void *buffer,
        size_t size);
extern void UARTCC26X0_writeCancel(UART_Handle handle);
extern int_fast32_t UARTCC26X0_writePolling(UART_Handle handle, const void *buffer,
        size_t size);

/* UART function table for UARTMP432 implementation */
const UART_FxnTable myUARTCC26X0_fxnTable = {
    UARTCC26X0_close,
    UARTCC26X0_control,
    UARTCC26X0_init,
    UARTCC26X0_open,
    UARTCC26X0_read,
    NULL, /* UARTCC26X0_readPolling, */
    NULL, /* UARTCC26X0_readCancel, */
    UARTCC26X0_write,
    NULL, /* UARTCC26X0_writePolling, */
    NULL /* UARTCC26X0_writeCancel, */
};

/* UART objects */
UARTCC26X0_Object uartCC26XXObjects[CC1350STK_UARTCOUNT];
unsigned char uartCC26XXRingBuffer[CC1350STK_UARTCOUNT][32];

/* UART hardware parameter structure, also used to assign UART pins */
const UARTCC26X0_HWAttrs uartCC26XXHWAttrs[CC1350STK_UARTCOUNT] = {
    {   /* CC1350STK_UART0 */
        .baseAddr = UART0_BASE,
        .intNum = INT_UART0_COMB,    /* <driverlib>/inc/hw_ints.h */
        .intPriority = (0xc0),
        .swiPriority = 0,
        .txPin = Board_DP5_UARTTX,
        .rxPin = Board_DP4_UARTRX,
        .ctsPin = PIN_UNASSIGNED,
        .rtsPin = PIN_UNASSIGNED,
        .ringBufPtr     = uartCC26XXRingBuffer[0],
        .ringBufSize    = sizeof(uartCC26XXRingBuffer[0])
    },
};

/* UART configuration structure */
const UART_Config UART_config[] = {
    {
        .fxnTablePtr = &myUARTCC26X0_fxnTable,
        .object      = &uartCC26XXObjects[0],
        .hwAttrs     = &uartCC26XXHWAttrs[0]
    },
};

const uint_least8_t UART_count = CC1350STK_UARTCOUNT;

/*
 *  ============================= UDMA ===================================
*/

/* Include drivers */
#include <ti/drivers/dma/UDMACC26XX.h>

/* UDMA objects */
UDMACC26XX_Object udmaObjects[CC1350STK_UDMACOUNT];

/* UDMA configuration structure */
const UDMACC26XX_HWAttrs udmaHWAttrs[CC1350STK_UDMACOUNT] = {
    {
        .baseAddr = UDMA0_BASE, 
        .powerMngrId = PowerCC26XX_PERIPH_UDMA,
        .intNum = INT_DMA_ERR,    /* <driverlib>/inc/hw_ints.h */
        .intPriority = (~0)
    },
};

/* UDMA configuration structure */
const UDMACC26XX_Config UDMACC26XX_config[] = {
    {
        .object  = &udmaObjects[0],
        .hwAttrs = &udmaHWAttrs[0]
    },
};

/*
 *  ======== Board_initPIN ========
 */
void Board_initPIN()
{
    PIN_init(BoardGpioInitTable);
}

static Power_NotifyObj energiaNotifyObject;
extern void energiaTimeSync(void);

/*
 *  ======== Board_initPower ========
 */
void Board_initPower(void)
{
    Power_init();

    /*
     * resync micros() and millis() time bases after
     * clock to SysTick has been cut while in deep sleep
     */
    Power_registerNotify(&energiaNotifyObject, PowerCC26XX_AWAKE_STANDBY,
                         (Power_NotifyFxn)energiaTimeSync, (uintptr_t)NULL);
}

/*
 *  ======== Board_init ========
 */
void Board_init(void)
{
    /* driver-independent initialization */

    /* driver-specific initialization */
    Board_initPower();
    Board_initPIN();
    GPIO_init();
}
